package com.github.hummel.union.lang

object LangBeBy {
	val JSON: String = """
		{
			"NO_CONNECTION": "Сайт з нейрасецівам тэрмінова недаступны.",
			"EXIT": "Прыкладанне будзе выключана.",
			"NUKE": "Паведамленні выдалены.",
			"RANDOM": "Выпадковы лік: %d.",
			"NO_BIRTHDAYS": "Днёў нараджэння няма.",
			"HAPPY_BIRTHDAY": "%s, з днём нараджэння!",
			"NO_ACCESS": "Вы не можаце выкарыстоўваць гэтую каманду.",
			"IMPORT": "Даныя імпартаваны.",
			"INVALID_ARG": "Недапушчальныя аргументы.",
			"INVALID_FORMAT": "Недапушчальны фармат аргументаў.",
			"SET_LANGUAGE": "Усталявана мова: %s.",
			"SET_CHANCE": "Усталяваны шанс паведамлення: %d.",
			"CURRENT_LANGUAGE": "Бягучая мова інтэрфейса: %s.",
			"CURRENT_CHANCE": "Бягучы шанс паведамлення: %d.",
			"ADDED_MANAGER": "Дададзена кіраўніцкая роль: %s.",
			"ADDED_CHANNEL": "Дададзены сакрэтны канал: %s.",
			"ADDED_BIRTHDAY": "Дададзены дзень нараджэння: %s, %d.%d.%d.",
			"REMOVED_MANAGER": "Выдалена кіраўніцкая роль: %s.",
			"REMOVED_CHANNEL": "Выдалены сакрэтны канал: %s.",
			"REMOVED_BIRTHDAY": "Выдалены дзень нараджэння: %s.",
			"CLEARED_MANAGERS": "Кіраўніцкія ролі сервера ачышчаны.",
			"CLEARED_CHANNELS": "Сакрэтныя каналы сервера ачышчаны.",
			"CLEARED_BIRTHDAYS": "Дні нараджэння сервера ачышчаны.",
			"CLEARED_DATA": "Даныя сервера ачышчаны.",
			"CLEARED_MESSAGES": "Паведамленні сервера ачышчаны.",
			"GAME_YES_1": "Так.",
			"GAME_YES_2": "Можаш не сумнявацца ў гэтым)",
			"GAME_YES_3": "Менавіта вось так!",
			"GAME_YES_4": "Я ўпэўнены ў гэтым на ўсе сто адсоткаў!",
			"GAME_NO_1": "Не.",
			"GAME_NO_2": "Я лічу, што не)",
			"GAME_NO_3": "Адназначна не!",
			"GAME_NO_4": "Не, я ўпэўнены ў гэтым на ўсе сто адсоткаў.",
			"MSG_ACCESS": "Доступ",
			"MSG_ERROR": "Памылка",
			"MSG_SUCCESS": "Поспех"
		}
	""".trimIndent()
}